app/controllers/companies_controller.rb

  def index
    @companies = Company.all
---
SELECT "companies".* FROM "companies"

  def create
    @company = Company.new(company_params)

    if @company.save
---
INSERT INTO "companies" ("name", "industry", "open", "close", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Apple"], ["industry", "Tech"], ["open", 154.0], ["close", 300.0], ["notes", "Buy "], ["created_at", "2019-08-17 05:07:33.741015"], ["updated_at", "2019-08-17 05:07:33.741015"]]

  def update
    if @company.update(company_params)
---
UPDATE "companies" SET "notes" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["notes", "SELL"], ["updated_at", "2019-08-17 07:11:22.928876"], ["id", 11]]

  def destroy
    @company.destroy
---
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 12]]

    def set_company
      @company = Company.find(params[:id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]